c5/src/Documents/Entry/Entry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Entry</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Simple</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Records</name>
    <attributes>
      <name>AccountCr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountDr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyCr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyDr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorCr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorDr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityCr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityDr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RateCr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>RateDr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/Entry/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	DocumentPresentation.IncomingFields ( Fields, StandardProcessing );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	DocumentPresentation.IncomingPresentation ( Metadata.Documents.Entry.Synonym, Data, Presentation, StandardProcessing );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	if ( not checkErrors ( Env ) ) then
		return false;
	endif;
	commit ( Env );
	flagRegisters ( Env );
	return true;
	
EndFunction
 
Procedure getData ( Env )
	
	sqlFields ( Env );
	sqlRecords ( Env );
	sqlBalance ( Env );
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Documents.Date as Date, Documents.Company as Company
	|from Document.Entry as Documents
	|where Documents.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlRecords ( Env )
	
	s = "
	|// #Records
	|select
	|	case
	|		when Records.AccountDr = value ( ChartOfAccounts.General.EmptyRef )
	|			and not Records.AccountCr.OffBalance then
	|			value ( ChartOfAccounts.General._0 )
	|		else
	|			Records.AccountDr
	|	end as AccountDr,
	|	case
	|		when Records.AccountCr = value ( ChartOfAccounts.General.EmptyRef )
	|			and not Records.AccountDr.OffBalance then
	|			value ( ChartOfAccounts.General._0 )
	|		else
	|			Records.AccountCr
	|	end as AccountCr,
	|	Records.CurrencyDr as CurrencyDr, Records.CurrencyAmountDr as CurrencyAmountDr, Records.RateDr as RateDr,
	|	Records.FactorDr as FactorDr, Records.QuantityDr as QuantityDr, Records.DimDr1 as DimDr1, Records.DimDr2 as DimDr2,
	|	Records.DimDr3 as DimDr3, Records.CurrencyCr as CurrencyCr,
	|	Records.CurrencyAmountCr as CurrencyAmountCr, Records.RateCr as RateCr, Records.FactorCr as FactorCr,
	|	Records.QuantityCr as QuantityCr, Records.DimCr1 as DimCr1, Records.DimCr2 as DimCr2,
	|	Records.DimCr3 as DimCr3, Records.Content as Content, Records.Amount as Amount
	|from Document.Entry.Records as Records
	|where Records.Ref = &Ref
	|order by Records.LineNumber
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlBalance ( Env )
	
	s = "
	|// @Error
	|select 1
	|from Document.Entry.Records as Records
	|where Records.Ref = &Ref
	|and not Records.AccountDr.OffBalance
	|and not Records.AccountCr.OffBalance
	|having sum ( Records.AmountDr ) <> sum ( Records.AmountCr )
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Function checkErrors ( Env )
	
	if ( Env.Error = undefined ) then
		return true;
	endif;
	Output.UnbalancedEntry ( , , Env.Ref );
	return false;
	
EndFunction

Procedure commit ( Env )
	
	p = GeneralRecords.GetParams ();
	fields = Env.Fields;
	p.Date = fields.Date;
	p.Company = fields.Company;
	p.Recordset = Env.Registers.General;
	for each row in Env.Records do
		p.AccountDr = row.AccountDr;
		p.AccountCr = row.AccountCr;
		p.Amount = row.Amount;
		p.QuantityDr = row.QuantityDr;
		p.QuantityCr = row.QuantityCr;
		p.DimDr1 = row.DimDr1;
		p.DimDr2 = row.DimDr2;
		p.DimDr3 = row.DimDr3;
		p.DimCr1 = row.DimCr1;
		p.DimCr2 = row.DimCr2;
		p.DimCr3 = row.DimCr3;
		p.CurrencyDr = row.CurrencyDr;
		p.CurrencyAmountDr = row.CurrencyAmountDr;
		p.CurrencyCr = row.CurrencyCr;
		p.CurrencyAmountCr = row.CurrencyAmountCr;
		p.Content = row.Content;
		GeneralRecords.Add ( p );
	enddo; 

EndProcedure 

Procedure flagRegisters ( Env )
	
	Env.Registers.General.Write = true;
	
EndProcedure

#endregion

#endif
